ArtMoney Plugin
8.17//Version
汉化苦力_(:зゝ∠)_//Translated into chinese by - 译者需要加的标题
Katsuki Kami//此插件的译者, 如果为空则是 System SoftLab
Kikka.12.25@Gmail.com//译者的E-mail,如果为空则是 artmoney@systemsoftlab.com
关于
修改器
<yyyy>年<m>月<d>日//日期格式
版权所有(C) 1996-2021, System SoftLab
如果您发现了问题或是
有什么好的建议，请发 E-mail 到
请访问 ArtMoney 网站以获取最新版本。
数值
搜索
过滤
要查找的数值
首先选择游戏进程
现在开始搜索
不断筛选符合的数值直到数量不再减少
抱歉，你什么都没找到。再试一次吧。
关闭
共找到
个地址
个地址
个地址
列表中有
载入错误
搜索出错
过滤出错
不支持这个文件格式
输入的数据超出范围
无法加载
搜索
筛选
所有可能的地址
字节
字节
字节
查找类型错误，请换一个。
秒
分
您还没有选择数据类型
选定的类型比原来的类型多
数值已改变
数值没变化
数值已增加
数值已减少
无法读取新版本的地址列表
地址列表文件损坏！
文件访问出错
单字节整数
双字节整数
三字节整数
四字节整数
八字节整数
四字节浮点数
六字节浮点数
八字节浮点数
十字节浮点数
字符串
无终结符字符串
空字符串
Pascal 格式的字符串
逆序双字节整数
逆序三字节整数
逆序四字节整数
逆序八字节整数
逆序四字节浮点数
逆序六字节浮点数
逆序八字节浮点数
逆序十字节浮点数
逆序字符串
逆序空字符串
逆序 Pascal 字符串
一月
二月
三月
四月
五月
六月
七月
八月
九月
十月
十一月
十二月
锁定
帮助
关于
选择进程
清除数据列表
载入数据列表
存储数据列表
添加到数据列表
全部加入
修改
复制
删除
锁定
解除锁定
自动应用偏移量
进程信息
进程类型
自动锁定间隔时间(毫秒)
刷新列表间隔时间(毫秒)
界面语言
显示查找到的地址个数
弹出热键
一般设置
附加设置
个人信息
电子邮件
默认的列表文件说明
操作系统
舍入到小数点后位数
数据字节排序
搜索进程优先级
高
实时
选项
取消
正常
编辑地址
锁定
大小
地址
名称
数据类型
逆序
准确值
一串数值
有范围的数值
无法确定的数值
加密的数值
自定义
选择数据类型
字节顺序
正序和逆序
所有
整数
浮点数
已用时间：
剩余时间：
搜索速度:
共找到:
游戏名
说明
日期
操作系统
列表文件信息
作者
姓名
地址
输入一串数据
设置热键
逆序
在此地址区块内查找
在地址范围内查找
减少对磁盘空间的占用
从
到
搜索
筛选
步骤
步骤//set value
设置值
选择所有数据
自动
显示进程
可见
带窗口
进程信息
结束任务
显示窗口
隐藏窗口
你确定要结束这个进程吗？
访问被拒绝
无法结束进程
文件名
进程类型
数据大小
评估
评估内存查找的速度
稍等
您的系统
特殊的热键
将指定值增加
锁定这个窗口
使用"撤销/重做查找"功能
整数的显示方式
无符号
有符号
撤销上次查找
重做被撤消的查找
保存查找结果
载入查找结果
当前的查找次数为：
"撤销查找"功能未启动
"重做查找"功能未启动
"载入查找"功能未启动
比原来增加
比原来减少
界面
热键
热键功能已启用
缺省热键
界面字体
列表字体
程序背景颜色
输入框背景颜色
按钮颜色
使用椭圆形按钮
确认
内存编辑器
以十六进制显示
以十六进制编辑
显示的列数
单元格查看方式
当前单元格
移动
在查找结果中移动
在地址列表中移动
在内存块之间移动
跳转到地址
第一个
上一个
下一个
最后一个
总计
当前
复制所选区域
覆盖所选区域
加入地址列表
所有(常见)
整数(常见)
浮点数(常见)
反向选择
列对齐
<无效>
指针
刷新
修改所有选中的项
分组
只显示以下的组
选择所有同组数据
暂存当前地址/指针
将偏移量应用到所有数值
将偏移量应用到本组数值
将暂存地址与当前地址的偏移量应用到所有数值
将暂存地址与当前地址的偏移量应用到本组数值
指针相关命令
所有数据以此指针为基地址
本组数据以此指针为基地址
所有数据以暂存指针为基地址
本组数据以暂存指针为基地址
所有指针偏移到此地址
所有指针偏移到暂存地址
查找指向此地址的指针
查找指向段首到此地址之间的指针
排序
按名称排序
按地址排序
按数值排序
将数值当作文本排序
按所属的组排序
合并
无法合并
两个列表必须由同一个人创建
选择当前进程
字符集
用下拉菜单切换组
在组中
将指针转换成普通地址
过滤地址
字符串
<文件没找到>
<拒绝访问>
文件编辑器
出错
<文件大小已改变>
界面风格
系统默认
编辑区字体
列表颜色
内存转储
按照公式
进程
暂停进程
继续进程
存储进程
载入进程
进程 ID
线程
文件
文件信息
选择文件
选择文件夹
文件总数
总共大小
在目录下的文件中移动
对象
列表
退出
结果
更多
在线购买"ArtMoney Pro"
访问主页
ArtMoney 使用说明
编码方式
选择编码方式
亮度
色调
显示主菜单
使用非官方语言包
查找时暂停进程
存储/载入文件地址列表中的数据
进程浏览器的库文件
文件夹选项
文件名过滤
修改时间
创建日期
创建时间
不检查
最近15分钟
最近一小时
最近一天
最近一月
最近一年
迟于
早于
此功能只限 ArtMoney 专业版使用
仅限ArtMoney专业版
许可协议
我同意此许可协议中的条款和前提
关于专业版
鸣谢
设计用户手册
标志设计
安装模块
绘制图标
为英文版手册检查语法
帮助文件
界面引擎（ThemeEngine 软件包）
有价值的意见和改进建议
翻译
列表文件
注册号
未注册
不再询问密码
只用于当前的视窗用户
暂停进程并弹出
恢复进程并返回
多余的右括号
必需的右括号
多余的引号
无效的标识符
无效的参数个数(M1,M2...)
无效的运算符个数(-,+)
无效的条件个数(<,>,=)
无效的表达式个数
无效的表达式
这个步骤不存在
无效的条件
以下函数中有无效参数
没有条件
搜索中
注册码
密码
请输入密码后按"确认"
密码错误
注册文件错误
没有注册文件
默认值
操作被用户取消
手册语言
没找到进程或拒绝访问
只在前台时刷新列表中的数值
代码大小
进程记忆体分配表
段地址
分配状况
段保护
保护
模组名称
此功能只能用在 Windows 2000/XP/2003/VISTA/2008/7/8/2012/10 系统中。
存储/载入进程
模式
指定的进程无效，可能已经被改变或重开。
关闭
用 Excel 查看
循环小数
(Adobe) Flash 小游戏
范围
在内存中保留进程
保留物理内存大小
执行新任务
安装
在桌面制作快捷方式
隐藏进程
显示进程
模拟器
游戏系统
地址范围
使用模拟器选项
模拟器内存图
模拟器地址
PC 地址
您想将模拟器地址转换成 PC 地址吗？
您想将 PC 地址转换成模拟器地址吗？
地址转换错误
从文件名自动检测模拟器
组
显示组树
无
左
右
新组
主要
语言
您想要删除这种语言吗？
您要增加新语言吗？
您要更改语言名称吗？
普通锁定
可增加
可减少
从最少到最多
最少
最多
复制已选择
下载"间谍软件探测器"
在你的电脑里没有发现"间谍软件探测器"。 你可以从我们的官方网站下载与安装 www.systemsoftlab.com 。 这个程序可以与 ArtMoney 一起工作。 使用"间谍软件探测器"，你可以打开任何隐藏的或者被阻止打开的进程。 "间谍软件探测器"能显示正在您电脑中运行的全部软件程序和（防毒软件未侦测到的）间谍软件、木马和病毒。
有任何建议或错误报告请反馈给
浏览我们的官方网站和下载其它软件。
这是免费的受限版本。 只要 99 元您就能购买一个完全版。（一次性支付—后续的升级免费！）
只有注册用户才能得到技术支持，并使用所有附加功能。
要购买，请确保您已经连接到网络，并且点击下面的"在线注册"按钮。
马上在线注册
安装服务
Windows 安装服务需要用户授权
使用当前用户安装
用户名称
域名
服务安装错误
登录失败
隐身模式
隐藏我的进程
隐藏我的窗口
已安装旧版服务。请您重启电脑安装新版本。
列表已改变
你想保存更改吗？
在退出时询问是否保存未保存的列表
结构
已跳过
领域
结构大小不能超过
项目
新项目
从列表搜索结构
从组搜索结构
从选择的地址搜索结构
移上
移下
免费获取 AM Pro: 中国大陆用户无法获得
俄文手册语法检查
循环类型
近似值（四舍五入）
舍去
进位
向零循环
继续
免费获取
反汇编程序
集合指令
使用模块地址
模块
在模块的地址
转换错误
无法转换模组地址：进程没有这样的模组。
扫描系统内存区域的模块
扫描共享内存区域的模块
打开程序错误
无法打开本软体。
请尝试使用专业版本。
这个列表需要专业版本
注册无效
无效地址
无效数值
数值太大
无效的汇编指令
请右键单击 ArtMoney 程序，在右键菜单中选择“以管理员身份运行”。
服务启动错误
服务开启错误
尝试重新启动您的电脑
被它改变：
列表转换
你想转换列表到64位模式吗？
你想转换列表到32位模式吗？
转换出错。程序无法转换地址到32位模式。
地址倍数//地址可被整除
偶数//2整除
奇数
4 的倍数//4整除
8 的倍数//8整除
16 的倍数//16整除
只扫描模块的静态地址
显示模块选项
输入注册码
请粘贴您的注册代码（使用 Ctrl - V 或"粘贴"按钮），点击"确认"
粘贴
该注册代码是无效的
该注册代码只适合英文版
该注册代码只适合俄文版
该注册代码只适合旧版
该注册代码不能用了。请联系 sales@systemsoftlab.com 索取你的新注册码
如果您没有在此处看到您的名字和数据，那么此软件为破解或盗版，且此版本将无法正常运行！
指针的指针
最大偏移
级别从
搜索指针的指针
特别版最大2层！
尝试禁用驱动程序强制签名
快速模式（使用更多的内存）
Mb
自动应用偏移并复制到新组
地址块
无法转换地址块：在进程中没有这样的块。
转换问题：块大小不是唯一的。
按偏移排序指针
为了完全隐形模式而隐藏文本//VIP only
购买或出售网络游戏账户
新版本可供下载
检查新版本
指针偏移
搜索具有最大可用偏移量的指针
从第二步开始可用
公式
版本
总在最上
启用“总在最上”
禁用“总在最上”
无法打开 systemsoftlab.com ，请检查你的网络连接！
尝试设置选项
名称/模块
十六进制代码
注册
标记
附加调试器
移除调试器
你想对选中的进程附加调试器吗？
断点列表
命令
调试
保存调试信息
读取调试信息
汇编语言
x86-32位
x86-64位
断点
增加断点
移除断点
运行
运行到
直到返回
跟踪步骤
跟踪步骤结束
设置地址名
移除地址名
是
否
调试器类型
标准
异常处理
程序断点的类型
软件（int3 指令）
int3
调试寄存器（最大 4 个）
寄存器
页面异常
异常
访问断点的类型
当挂载调试器时询问
当所有调试寄存器已被占用时使用软件断点
自动保存/读取调试信息
使用调试符号
符号路径
激活
中断
执行
任何访问
写入
条件
改变
全部启用
全部禁用
找出访问该地址的指令
在访问内存时
在写入内存时
条件错误
更改错误
除以零
读取错误
写入错误
左边不对
开始
停止
访问
清除结果
除以线程数量
数量
线程
8位
16位
32位
十六进制
十六进制
四字节浮点数
八字节浮点数
十六进制序列
systemsoflab.com 服务器无响应，或无网络连接
注册码已被封禁
你每天只能用这个激活码两次
这个激活码只能用在 VIP 版上
隐藏调试器
用 Unicode 保存列表
获取大小直到函数结束（直到返回）
许可证
扫描内存区域
数据可擦写
数据只读
代码可擦写
代码只读
共享
系统
受保护
隐藏
每个地址的倍数
地址名称和符号列表
文件夹符号
用户名
区分大小写
整词
第一个位置
读/写
自动检测函数大小
隐藏调试寄存器
给这个函数（结构）打补丁
绕过进程保护措施
使用内置功能访问内存
用户模式功能（挂载到进程）
内核模式功能（通过驱动）
在不使用 OpenProcess 的情况下挂载到进程
签名
签名搜索
增加签名
偏移
自动搜索
静态地址
区域
作为汇编代码编辑
作为汇编代码
转换为十六进制
限制每层的唯一偏移量
代码替换
替换代码
同时替换所有代码
<已替换>
<没替换>
<无模块>
<无块>
<无签名>
<无变量>
代码注入
注入代码
仅在成功替换代码之后
自动替换所有代码并注入
允许自动替换所有代码并注入
请求权限以自动替换所有代码并注入
该表包含一个用于注入并替换的代码。它可能是恶意的代码！仅从最受信任的网站下载列表！你想在这个进程中注入代码吗？
替换所有代码并注入
取消代码替换和注入
签名
原始签名
错误的原始签名
签名的地址//full
签名地址//short
变量/标签的地址//full
变量的地址//short
我不能转换签名的地址：没有这样的签名。
我不能转换变量的地址：没有这样的变量。
名称//variable or label
替换用的代码大小 
一条汇编指令
几条汇编指令
行
相对寻址错误（偏移量太大）
无效倍数
回跳出错//Return jmp error (jmp to original game code)
无法分配内存
区域//Memory areas
设置镜像地址
清除镜像地址
从最小地址
服务
以十六进制显示指针偏移量
使用 RAX(EAX) 寄存器。只有带 RAX(EAX) 寄存器的 MOV 汇编指令可以读/写绝对地址！
改变进程速度
你的速度 (%)
正常//Speedd
改变进程速度出错
增加进程速度
降低进程速度
堆栈
作为堆栈查看
保存线程堆栈
返回地址
参数
参数
在一行中显示参数
仅在模块中的返回地址
读取内存错误
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
5EE5A9D1